# Напишите программу, которая находит длину гипотенузы для прямоугольного треугольника по двум катетам.(с=sqrt(a * a + b * b))

a = 10
b = 15
c = (a * a + b * b) ** 0.5
print(c)
